# dasilvacontin's wannabe Brewfile

cask_args appdir: '/Applications'
tap 'caskroom/cask'

cask 'franz'
cask 'slack'
cask 'google-chrome'
cask 'spotify'
cask '1Password'
cask 'steam'

# productivity
cask 'caffeine'
cask 'flux'
cask 'launchbar'
cask 'mojibar'
brew 'tree'
brew 'zsh'

# dev
cask 'iterm2'
brew 'tmux'
brew 'the_silver_searcher'
brew 'thefuck'
tap 'goles/battery'
brew 'battery'
brew 'hub' # https://hub.github.com
brew 'direnv'
cask 'ngrok'
brew 'jq'
brew 'fzf'
brew 'fpp'
brew 'vim', args: ['override-system-vi']
cask 'atom'
brew 'nvm'
brew 'go'
cask 'java'
brew 'android-sdk'
cask 'android-file-transfer'
cask 'dash'

# design
cask 'sketch'
brew 'imagemagick'
